# auccat_dic = {
# 		"すべて":"0",
# 		"コンピュータ":"23336",
# 		"家電、AV、カメラ":"23632",
# 		"音楽":"22152",
# 		"本、雑誌":"21600",
# 		"映画、ビデオ":"21964",
# 		"おもちゃ、ゲーム":"25464",
# 		"ホビー、カルチャー":"24242",
# 		"アンティーク、コレクション":"20000",
# 		"スポーツ、レジャー":"24698",
# 		"自動車、オートバイ":"26318",
# 		"ファッション":"23000",
# 		"アクセサリー、時計":"23140",
# 		"ビューティー、ヘルスケア":"42177",
# 		"食品、飲料":"23976",
# 		"住まい、インテリア":"24198",
# 		"ペット、生き物":"2084055844",
# 		"事務、店舗用品":"22896",
# 		"花、園芸":"26086",
# 		"チケット、金券、宿泊予約":"2084043920",
# 		"ベビー用品":"24202",
# 		"タレントグッズ":"2084032594",
# 		"コミック、アニメグッズ":"20060",
# 		"不動産":"2084060731",
# 		"チャリティー":"2084217893",
# 		"その他":"26084",
# 	}
# print("<p>")
# for key, value in auccat_dic.items():
# 	print("<label><input type=\"radio\" name=\"radio_auccat\" value=\""+value+"\"> "+key+"</label>")
# print("</p>")

loc_dic = {
	"すべて":"0",
	"北海道":"1",
	"青森県":"2",
	"岩手県":"3",
	"宮城県":"4",
	"秋田県":"5",
	"山形県":"6",
	"福島県":"7",
	"茨城県":"8",
	"栃木県":"9",
	"群馬県":"10",
	"埼玉県":"11",
	"千葉県":"12",
	"東京都":"13",
	"神奈川県":"14",
	"山梨県":"15",
	"長野県":"16",
	"新潟県":"17",
	"富山県":"18",
	"石川県":"19",
	"福井県":"20",
	"岐阜県":"21",
	"静岡県":"22",
	"愛知県":"23",
	"三重県":"24",
	"滋賀県":"25",
	"京都府":"26",
	"大阪府":"27",
	"兵庫県":"28",
	"奈良県":"29",
	"和歌山県":"30",
	"鳥取県":"31",
	"島根県":"32",
	"岡山県":"33",
	"広島県":"34",
	"山口県":"35",
	"徳島県":"36",
	"香川県":"37",
	"愛媛県":"38",
	"高知県":"39",
	"福岡県":"40",
	"佐賀県":"41",
	"長崎県":"42",
	"熊本県":"43",
	"大分県":"44",
	"宮崎県":"45",
	"鹿児島県":"46",
	"沖縄県":"47",
	"海外":"48",
}
print("<p>")
for key, value in loc_dic.items():
	print("<label><input type=\"checkbox\" name=\"check_loc_cd\" value=\""+value+"\"> "+key+"</label>")
print("</p>")

# print("<p>")
# print("<ul>")
# for key, value in loc_dic.items():
# 	print("<li>")
# 	print("<input type=\"checkbox\" name=\"check_loc_cd\" value=\""+value+"\"> "+key+"")
# 	print("</li>")
# print("</ul>")
# print("</p>")
